Tekla Open API Reference for Tekla Structures 2025
BoltGroup.Bolt Property
 Indicates whether the instance is a bolt or just a hole.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Bolt { get; set; }
Public Property Bolt As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace